In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas 
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config.ini')

host = config['myaws']['host']
user = config['myaws']['user']
pwd = config['myaws']['pwd']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect(
                        host = host,
                        user = user,
                    password = pwd,
                      dbname = database
)

In [5]:
cur = conn.cursor()

## Q1

In [6]:
sql_statement = '''
                select * from student_g10
                
                '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

('tobinnc@dukes.jmu.edu                                                                               ',
 'Natalie Tobin                                                                                       ',
 'Intelligence Analysis                                                                               ')

In [9]:
for result in cur.fetchall():
    print(result)

('santicm@dukes.jmu.edu                                                                               ', 'Chris Santi                                                                                         ', 'Intelligence Analysis\n                                                                              ')
('dovalamm@dukes.jmu.edu                                                                              ', 'Morgan Dovala\n                                                                                      ', 'Intelligence Analysis                                                                               ')
('topacinv@dukes.jmu.edu                                                                              ', 'Daniel Topacio                                                                                      ', 'Intelligence Analysis                                                                               ')
('orschaa@dukes.jmu.edu                                                                               ', 'Alexa Orosch                                                                                        ', 'Geographic Science\n                                                                                 ')

In [10]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,tobinnc@dukes.jmu.edu ...,Natalie Tobin ...,Intelligence Analysis ...
1,santicm@dukes.jmu.edu ...,Chris Santi ...,Intelligence Analysis\n ...
2,dovalamm@dukes.jmu.edu ...,Morgan Dovala\n ...,Intelligence Analysis ...
3,topacinv@dukes.jmu.edu ...,Daniel Topacio ...,Intelligence Analysis ...
4,orschaa@dukes.jmu.edu ...,Alexa Orosch ...,Geographic Science\n ...

In [11]:
df.describe()

,email,name,major
count,5,5,5
unique,5,5,3
top,orschaa@dukes.jmu.edu ...,Alexa Orosch ...,Intelligence Analysis ...
freq,1,1,3

## Q2

In [12]:
sql_statement2 = '''
                select
                cname, count(semail)
                from enroll_g10
                group by cname
                order by count(cname) desc
                '''

In [13]:
cur.execute(sql_statement2)

In [14]:
cur.fetchone()

('IA 300                                                                                              ',
 2)

In [15]:
for result in cur.fetchall():
    print (result)

('IA 341                                                                                              ', 1)
('IA 313                                                                                              ', 1)
('IA 459                                                                                              ', 1)

In [16]:
df = pandas.read_sql_query(sql_statement2,conn)
df[:]

                                               cname  count
0  IA 300                                        ...      2
1  IA 341                                        ...      1
2  IA 313                                        ...      1
3  IA 459                                        ...      1

IA 300 has the most students enrolled

## Q3

In [17]:
sql_statement3 = '''
                select * from teacher_g10
                inner join course_10
                on teacher_g10.email = course_10.temail
                '''

In [18]:
cur.execute(sql_statement3)

In [19]:
cur.fetchone()

('weixx@jmu.edu                                                                                       ',
 'Xuebin Wei                                                                                          ',
 'isat112             ',
 'IA 341                                                                                              ',
 'Engeo2201           ',
 'weixx@jmu.edu                                                                                       ')

In [20]:
for result in cur.fetchall():
    print(result)

('taoqx@jmu.edu                                                                                       ', 'Tom Tao                                                                                             ', 'isat116             ', 'IA 300                                                                                              ', 'Engeo2202           ', 'taoqx@jmu.edu                                                                                       ')
('moore8ka@jmu.edu                                                                                    ', 'Kathleen Moore                                                                                      ', 'engeo114            ', 'IA 261                                                                                              ', 'Engeo2204           ', 'moore8ka@jmu.edu                                                                                    ')
('hendrinx@jmu.edu                                                                                    ', 'Noel Hendrickson                                                                                    ', 'engeo110            ', 'IA 313                                                                                              ', 'Engeo2205           ', 'hendrinx@jmu.edu                                                                                    ')
('ronbj@jmu.edu                                                                                       ', 'Ron Burgundy                                                                                        ', 'isat069             ', 'IA 378                                                                                              ', 'Mu305               ', 'ronbj@jmu.edu                                                                                       ')
('ronbj@jmu.edu                                                                                       ', 'Ron Burgundy                                                                                        ', 'isat069             ', 'IA 459                                                                                              ', 'Isat300             ', 'ronbj@jmu.edu                                                                                       ')

In [21]:
df = pandas.read_sql_query(sql_statement3,conn)
df[:]

,email,name,office,name,room,temail
0,weixx@jmu.edu ...,Xuebin Wei ...,isat112,IA 341 ...,Engeo2201,weixx@jmu.edu ...
1,taoqx@jmu.edu ...,Tom Tao ...,isat116,IA 300 ...,Engeo2202,taoqx@jmu.edu ...
2,moore8ka@jmu.edu ...,Kathleen Moore ...,engeo114,IA 261 ...,Engeo2204,moore8ka@jmu.edu ...
3,hendrinx@jmu.edu ...,Noel Hendrickson ...,engeo110,IA 313 ...,Engeo2205,hendrinx@jmu.edu ...
4,ronbj@jmu.edu ...,Ron Burgundy ...,isat069,IA 378 ...,Mu305,ronbj@jmu.edu ...
5,ronbj@jmu.edu ...,Ron Burgundy ...,isat069,IA 459 ...,Isat300,ronbj@jmu.edu ...

# Q4

In [22]:
sql_statement4 = '''
                select
                teacher_g10.name as tname,
                count (course_10.name) as course_num
                from teacher_g10
                inner join course_10
                on teacher_g10.email = course_10.temail
                group by teacher_g10.name
                '''

In [23]:
cur.execute(sql_statement4)

In [24]:
cur.fetchone()

('Noel Hendrickson                                                                                    ',
 1)

In [25]:
for result in cur.fetchall():
    print(result)

('Xuebin Wei                                                                                          ', 1)
('Kathleen Moore                                                                                      ', 1)
('Ron Burgundy                                                                                        ', 2)
('Tom Tao                                                                                             ', 1)

In [26]:
df = pandas.read_sql_query(sql_statement4,conn)
df[:]

                                               tname  course_num
0  Noel Hendrickson                              ...           1
1  Xuebin Wei                                    ...           1
2  Kathleen Moore                                ...           1
3  Ron Burgundy                                  ...           2
4  Tom Tao                                       ...           1

# Q5

In [27]:
sql_insert_statement = '''
                insert into teacher_g10(email,name,office)
                values('bobjm@jmu.edu','Bob Burger','Engeo2203')
                '''.format('bobjm@jmu.edu','Bob Burger','Engeo2203')
print(sql_insert_statement)

                insert into teacher_g10(email,name,office)
                values('bobjm@jmu.edu','Bob Burger','Engeo2203')

In [28]:
conn.commit()

In [29]:
df = pandas.read_sql_query('''select * from teacher_g10''',conn)
df[:]

,email,name,office
0,weixx@jmu.edu ...,Xuebin Wei ...,isat112
1,taoqx@jmu.edu ...,Tom Tao ...,isat116
2,moore8ka@jmu.edu ...,Kathleen Moore ...,engeo114
3,hendrinx@jmu.edu ...,Noel Hendrickson ...,engeo110
4,ronbj@jmu.edu ...,Ron Burgundy ...,isat069

In [30]:
sql_insert2_statement = '''
                insert into course_10(name,room,temail)
                values('IA457','ISAT50','bobjm@jmu.edu')
                '''
print(sql_insert2_statement)

                insert into course_10(name,room,temail)
                values('IA457','ISAT50','bobjm@jmu.edu')

In [31]:
cur.execute(sql_insert2_statement)

ForeignKeyViolation: insert or update on table "course_10" violates foreign key constraint "course_10_temail_fkey"
DETAIL:  Key (temail)=(bobjm@jmu.edu                                                                                       ) is not present in table "teacher_g10".

In [ ]:
conn.commit()

In [ ]:
df = pandas.read_sql_query('''select * from course_10''',conn)
df[:]

# Q6

In [32]:
sql_insert3_statement = '''
                        update course_10
                        set temail = 'bobjm@jmu.edu'
                        where name = 'IA457'
                        '''
print(sql_insert3_statement)

                        update course_10
                        set temail = 'bobjm@jmu.edu'
                        where name = 'IA457'

In [33]:
cur.execute(sql_insert3_statement)

InFailedSqlTransaction: current transaction is aborted, commands ignored until end of transaction block

In [34]:
conn.commit()

In [35]:
df = pandas.read_sql_query('''select * from course_10''',conn)
df[:]

,name,room,temail
0,IA 341 ...,Engeo2201,weixx@jmu.edu ...
1,IA 300 ...,Engeo2202,taoqx@jmu.edu ...
2,IA 261 ...,Engeo2204,moore8ka@jmu.edu ...
3,IA 313 ...,Engeo2205,hendrinx@jmu.edu ...
4,IA 378 ...,Mu305,ronbj@jmu.edu ...
5,IA 459 ...,Isat300,ronbj@jmu.edu ...

In [36]:
sql_delete_statement = '''
                        delete from teacher_g10
                        where email = 'marrinsp@jmu.edu'
                        '''
print(sql_delete_statement)

                        delete from teacher_g10
                        where email = 'marrinsp@jmu.edu'

In [37]:
conn.commit()

In [38]:
df = pandas.read_sql_query('''select * from teacher_g10''',conn)
df[:]

,email,name,office
0,weixx@jmu.edu ...,Xuebin Wei ...,isat112
1,taoqx@jmu.edu ...,Tom Tao ...,isat116
2,moore8ka@jmu.edu ...,Kathleen Moore ...,engeo114
3,hendrinx@jmu.edu ...,Noel Hendrickson ...,engeo110
4,ronbj@jmu.edu ...,Ron Burgundy ...,isat069